#define _CRT_SECURE_NO_WARNINGS 1//scanf
#include <stdio.h>//printf
#include <string.h>

//字符串就是一串字符-双引号括起来的一串字符

//int main()
//{
//	//多个字符存起来 - 字符数组
//	//数组 - 一组数/一组相同类型的元素
//	
//	//每个字符串的结尾位置都隐藏了一个\0字符
//	//  \0是字符串的结束标志
//	char arr[] = "abc";//四个值0124   abc\0		结果为abc
//	char arr_2[] = { 'a','b','c' };//三个值012   abc		结果为abc烫烫烫烫虜怢\? 为什么有乱码,因为他没有结束标志\0
//	char arr_3[] = { 'a','b','c','\0' };//加上结束标志\0则解决问题
//
//	char arr_4[8] = "abcdefg";//方括号[] - 空的时候就会根据右值内容来初始化,,写上数字代表初始化右值的元素个数
//	
//	printf("%s\n", arr);
//	printf("%s\n", arr_2);
//	printf("%s\n", arr_3);
//	printf("%s\n", arr_4);
//
//	//求字符串长度 - strlen()
//	int len = strlen(arr_4);//警告“strlen”未定义   因为没有引用头文件 include <string.h>  警告≠报错
//	printf("%d\n", len);//7   字符串求长度时不计算\0
//	printf("%d\n", strlen(arr_2));//随机值	因为strlen是找到\0才结束计算
//	printf("%d\n", strlen(arr_3));//3	有\0
//	printf("%d\n", strlen(arr));//3	有\0
//	
//	
//	//转义字符 - 转义字符为一个长度
//	
//	//		\?在书写连续多个问号时使用,防止它们被解析成三字母词
//	printf("(are you ok ??)\n");//现在已经测不出来了
//
//	//		\'打印一个'
//	printf("%c\n", '\'');//	%c - 字符,对应''
//	//		\"打印一个"
//	printf("%s\n","\"");//	%s - 字符串,对应""
//	//		\\打印一个\ 
//	printf("C:\\text:\\text.txt\n");
//	//		\a警告字符,电脑会响起提示声音
//	//printf("\a\a\a");
//	//		\b退格符
//	//		\f进纸符
//	//		\n换行
//	//		\r回车
//	//		\t水平制表符
//	//		\v垂直制表符
//	//		\ddd		ddd表示1~3个八进制的数字,如:\130->X
//	printf("/bbb=%c\n", '\130');//将8进制的130转换为十进制		结果为X
//	//		\xdd		dd表示2个十六进制数字,如:\x30->0
//	printf("%c\n", '\x30');
//
//
//	//注释 - 解释复杂代码
//	
//	//		/**/的注释有一个缺陷,不支持嵌套注释 - 就是不能在注释里边再注释
//	/*
//	多行注释
//	0
//	1
//	2
//	*/
//
//
//
//	return 0;
//}